Revit 2027 API
BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForWidth Property
 Lining Thickness ([Lining Thickness Value]) is too large for current Width ([Width Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LiningThicknessIsLargeForWidth { get; }
Public Shared ReadOnly Property LiningThicknessIsLargeForWidth As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForWidth {
	FailureDefinitionId^ get ();
}
static member LiningThicknessIsLargeForWidth : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace